{
  "battles": [
    {
      "id": 1,
      "character json": "battleTyLee",
      "intro": "Welcome to your first battle. Prepare to meet your opponent: Ty Lee!",
      "enemy text": [
        "You know, you're kinda cute, Aang. Not cute enough to distract me from winning, though.",
        "I'm out of your league, kiddo. Now let's fight!",
        "Ugh, it's probably because I didn't wear pink today.",
        "You should wear pink more; maybe it'll make you a better fighter."
      ],
      "player text": [
        "Wait, I can't tell if you just called me cute or ugly.",
        "You're very pretty <3 <3 <3 I like your hair <3 <3 <3 uwu"
      ],
      "outro_win": "Congratulations, you defeated Ty Lee! You may proceed to the next battle.",
      "outro_lose": "Ty Lee wins! Try again next time."
    },
    {
      "id": 2,
      "character json": "battleMai",
      "intro": "Welcome to your second battle. Prepare to meet your opponent: Mai!",
      "enemy text": [
        "Why do I even have to fight you?",
        "Ugh I'm so over this already. Let's go.",
        "Whatever. Can I go home now?",
        "You asked for it."
      ],
      "player text": [
        "Uhhh, because we're enemies?",
        "You're bad, I'm good--it just makes sense!"
      ],
      "outro_win": "Congratulations, you defeated Mai! You may proceed to the next battle.",
      "outro_lose": "Mai wins! She doesn't seem to care, though."
    },
    {
      "id": 3,
      "character json": "battleIroh",
      "intro": "Welcome to your fourth battle. Prepare to meet your opponent: Iroh!",
      "enemy text": [
        "Young Avatar, are you sure you have what it takes?",
        "Prove it, then.",
        "Ah, I see you are ready.",
        "You need to drink more tea. Then you will be ready."
      ],
      "player text": [
        "I mean, I think so.",
        "Yes! I do I do!"
      ],
      "outro_win": "Congratulations, you defeated Iroh! You may proceed to the next battle.",
      "outro_lose": "Iroh wins! Try again next time."
    },
    {
      "id": 4,
      "character json": "battleLordOzai",
      "intro": "Welcome to your sixth battle. Prepare to meet your opponent: Fire Lord Ozai!",
      "enemy text": [
        "The Avatar has graced me with his presence. How delightful.",
        "I will destroy you, Avatar. Then I will rule the world.",
        "This is a one time loss. I will find you again.",
        "Now that I have defeated the Avatar, I can conquer all else."
      ],
      "player text": [
        "Oh, you're welcome, Fire Lord Ozai.",
        "Hmm, you don't sound too delighted."
      ],
      "outro_win": "Congratulations, you defeated Fire Lord Ozai! You may proceed to the next battle.",
      "outro_lose": "Fire Lord Ozai wins! Try again next time."
    },
    {
      "id": 5,
      "character json": "battleAzula",
      "intro": "Welcome to your seventh battle. Prepare to meet your opponent: Azula!",
      "enemy text": [
        "Hey, tiny Avatar. Can't believe you turned my poor excuse of a brother to your side.",
        "Oh, you're so funny. Time to get rid of you and take my place on the throne.",
        "NO I cannot lose to a puny bald child.",
        "The world is mine."
      ],
      "player text": [
        "Oh, Zuko? He's actually a pretty great guy.",
        "That's not very nice."
      ],
      "outro_win": "Congratulations, you defeated Azula! You may proceed to the next battle.",
      "outro_lose": "Azula wins! Try again next time."
    }
  ],
  "next episode": "Ep1dialogue.json"
}